cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "argocd"
brew "python@3.10"
brew "awscli"
brew "azure-cli"
brew "certigo"
brew "consul-backinator"
brew "coreutils"
brew "git"
brew "git-crypt"
brew "glib"
brew "guile"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "go"
brew "grep"
brew "helm"
brew "hugo"
brew "jq"
brew "jsonnet"
brew "kubectx"
brew "libslirp"
brew "make"
brew "minikube"
brew "mysql"
brew "nano"
brew "nghttp2"
brew "node"
brew "nvm"
brew "qemu"
brew "podman"
brew "pyenv"
brew "python@3.9"
brew "tfenv"
brew "tmate"
brew "tree"
brew "trivy"
brew "vault-cli"
brew "velero"
brew "watch"
brew "wget"
cask "gpg-suite-no-mail"
cask "vlc"
cask "google-cloud-sdk"
brew "kind"
cask "spotify"
cask "zoom"
cask "notion"
cask "virtualbox"
cask "visual-studio-code"
cask "google-chrome"
cask "docker"
tap "homebrew/cask-fonts"
cask "font-source-code-pro"